{
  "spec-documentation": {
    "title": "Project and Technical Documentation",
    "description": "We help you structure your digital product before development starts. You get detailed specifications, clear architecture, technology choices, and timelines — everything needed to plan, estimate, and launch development with confidence.",
    "whenDoYouNeedIt": "When you're preparing to build a digital product and need well-structured, technically sound project documentation that reflects best engineering practices. This documentation becomes the foundation for estimating timelines and budgets, aligning all stakeholders, and ensuring your development team has a clear and actionable roadmap.",
    "whatsIncluded": {
      "items": [
        {
          "title": "Understanding the product and goals",
          "text": "We start with interviews and goal analysis to define a sound product structure and scope."
        },
        {
          "title": "System and process design",
          "text": "We design user flows, screen maps, and API structure. We define entities and business modules."
        },
        {
          "title": "Tech stack and architecture choice",
          "text": "We select technologies and structure your app based on scalability, budget, and resources."
        },
        {
          "title": "Development plan and milestones",
          "text": "You get a comprehensive project plan with clear phases, deliverables, and implementation timelines."
        }
      ]
    },
    "result": "You receive detailed documentation that serves as a blueprint for development. This includes technical specifications, user flows, architecture diagrams, and a structured development plan. The documentation helps minimize risks, avoid scope creep, and ensures everyone — developers, designers, and stakeholders — is aligned on the vision and execution strategy.",
    "image": "/spec-documentation.png"
  },
  "documentation-audit": {
    "title": "Documentation Audit and Optimization",
    "description": "We analyze your existing project documentation to identify gaps, inconsistencies, and improvement opportunities. You get actionable recommendations to enhance clarity, completeness, and usability of your technical and project documentation.",
    "whenDoYouNeedIt": "When you have existing documentation that feels incomplete, outdated, or difficult to navigate. Perfect for teams struggling with knowledge gaps, onboarding challenges, or development bottlenecks caused by unclear specifications.",
    "whatsIncluded": {
      "items": [
        {
          "title": "Comprehensive documentation review",
          "text": "We analyze all existing docs: technical specs, user guides, API documentation, and process documents."
        },
        {
          "title": "Gap analysis and recommendations",
          "text": "Identify missing information, outdated content, and areas where clarity can be improved."
        },
        {
          "title": "Structure and organization optimization",
          "text": "Reorganize content for better navigation, searchability, and logical flow of information."
        },
        {
          "title": "Implementation roadmap",
          "text": "Step-by-step plan for implementing improvements with priority levels and estimated effort."
        }
      ]
    },
    "result": "You receive a detailed audit report with specific recommendations, reorganized content structure, and a clear implementation plan. This leads to more efficient team collaboration, faster onboarding, reduced support requests, and smoother development processes.",
    "image": "/documentation-audit.png"
  },
  "web-app-development": {
    "title": "Web Application Development",
    "description": "Custom web applications built with modern technologies and best practices. From MVP to enterprise-scale solutions, we deliver fast, secure, and scalable applications that grow with your business needs.",
    "whenDoYouNeedIt": "When you need a custom web application that standard solutions can't provide. Perfect for complex business logic, specific workflow requirements, or when you need full control over features, performance, and scalability.",
    "whatsIncluded": {
      "items": [
        {
          "title": "Full-stack development",
          "text": "Frontend, backend, database design, and API development using React, Node.js, and modern frameworks."
        },
        {
          "title": "User experience design",
          "text": "Intuitive interfaces designed for your specific users and business processes."
        },
        {
          "title": "Security and performance optimization",
          "text": "Built-in security measures, performance optimization, and scalability planning from day one."
        },
        {
          "title": "Testing and deployment",
          "text": "Comprehensive testing, CI/CD setup, and deployment to your preferred hosting environment."
        },
        {
          "title": "Documentation and training",
          "text": "Complete technical documentation and team training for ongoing maintenance and updates."
        }
      ]
    },
    "result": "A production-ready web application tailored to your specific requirements. Includes source code, deployment setup, comprehensive documentation, and training for your team. Built with scalability in mind to grow with your business.",
    "image": "/web-app-development.png"
  },
  "website-creation": {
    "title": "Website Creation and Design",
    "description": "Professional websites that combine beautiful design with optimal performance. From landing pages to complex corporate sites, we create web experiences that convert visitors into customers and reflect your brand perfectly.",
    "whenDoYouNeedIt": "When you need a professional web presence that stands out from competitors and drives business results. Perfect for businesses launching online, rebranding, or needing to improve their current website's performance and conversion rates.",
    "whatsIncluded": {
      "items": [
        {
          "title": "Custom design and branding",
          "text": "Unique visual identity that reflects your brand values and appeals to your target audience."
        },
        {
          "title": "Responsive development",
          "text": "Mobile-first approach ensuring perfect display and functionality across all devices and screen sizes."
        },
        {
          "title": "Content management system",
          "text": "Easy-to-use CMS allowing you to update content, images, and pages without technical knowledge."
        },
        {
          "title": "SEO optimization",
          "text": "Search engine optimization setup to improve visibility and attract organic traffic."
        },
        {
          "title": "Analytics and performance tracking",
          "text": "Built-in analytics setup to track visitor behavior, conversions, and site performance metrics."
        }
      ]
    },
    "result": "A fully functional, optimized website ready to drive business growth. Includes hosting setup, SSL certificate, analytics integration, and training on content management. Designed for long-term success with built-in SEO and performance optimization.",
    "image": "/website-creation.png"
  },
  "process-automation": {
    "title": "Business Process Automation",
    "description": "Streamline your operations with intelligent automation solutions. We identify manual, repetitive tasks and create custom automation workflows that save time, reduce errors, and improve efficiency across your organization.",
    "whenDoYouNeedIt": "When your team spends significant time on repetitive tasks, manual data entry, or complex workflows that could be streamlined. Perfect for scaling businesses that need to maintain quality while reducing operational overhead.",
    "whatsIncluded": {
      "items": [
        {
          "title": "Process analysis and mapping",
          "text": "We analyze your current workflows to identify automation opportunities and efficiency improvements."
        },
        {
          "title": "Custom automation development",
          "text": "Build tailored automation solutions using modern tools and APIs to connect your existing systems."
        },
        {
          "title": "Integration with existing tools",
          "text": "Connect your CRM, email, databases, and other business tools for seamless data flow and process execution."
        },
        {
          "title": "Testing and optimization",
          "text": "Thorough testing to ensure reliability, with ongoing optimization based on real-world usage patterns."
        },
        {
          "title": "Training and documentation",
          "text": "Complete documentation and team training to manage and extend your automation solutions."
        }
      ]
    },
    "result": "Automated workflows that run reliably in the background, freeing up your team for higher-value activities. Includes process documentation, monitoring setup, and maintenance guidelines. Typically results in 50-80% time savings on automated processes.",
    "image": "/process-automation.png"
  },
  "ai-integration": {
    "title": "AI Integration and Smart Solutions",
    "description": "Integrate artificial intelligence into your existing systems and workflows. From chatbots and automation to data analysis and decision support, we make AI work for your specific business needs without the complexity.",
    "whenDoYouNeedIt": "When you want to leverage AI to improve customer service, automate decision-making, analyze large datasets, or enhance user experiences. Perfect for businesses ready to gain competitive advantages through intelligent automation.",
    "whatsIncluded": {
      "items": [
        {
          "title": "AI strategy and planning",
          "text": "Identify the best AI applications for your specific business challenges and goals."
        },
        {
          "title": "Custom AI solution development",
          "text": "Build and integrate AI tools like chatbots, recommendation systems, or predictive analytics into your workflow."
        },
        {
          "title": "Data preparation and training",
          "text": "Prepare your data and train AI models to work effectively with your specific business context."
        },
        {
          "title": "Integration with existing systems",
          "text": "Seamlessly connect AI solutions with your current tools, databases, and business processes."
        },
        {
          "title": "Monitoring and optimization",
          "text": "Ongoing performance monitoring and model improvements to ensure optimal results over time."
        }
      ]
    },
    "result": "AI-powered features that enhance your business operations and customer experiences. Includes trained models, integration setup, performance monitoring, and documentation. Designed to provide measurable improvements in efficiency and decision-making quality.",
    "image": "/ai-integration.png"
  },
  "tvorflow-platform": {
    "title": "TvorFlow Platform - No-Code Application Development",
    "description": "Our proprietary no-code platform that automatically generates enterprise-grade applications from data structure configurations. Deploy complex business applications 70% faster with built-in CRUD operations, admin panels, and multi-tenant architecture.",
    "whenDoYouNeedIt": "When you need to rapidly develop and deploy business applications without extensive coding. Perfect for data-driven applications, internal tools, customer portals, and enterprise systems that require quick time-to-market with professional-grade functionality.",
    "whatsIncluded": {
      "items": [
        {
          "title": "Automated application generation",
          "text": "Define your data structures and automatically generate complete applications with CRUD operations, forms, and admin interfaces."
        },
        {
          "title": "Multi-tenant architecture",
          "text": "Built-in support for multiple organizations, projects, and user groups with sophisticated access control and data isolation."
        },
        {
          "title": "Enterprise-grade features",
          "text": "Automatic API generation, role-based permissions, audit logging, and scalable database architecture out of the box."
        },
        {
          "title": "Custom business logic integration",
          "text": "Extend generated applications with custom workflows, integrations, and business-specific functionality."
        },
        {
          "title": "Deployment and hosting setup",
          "text": "Complete deployment pipeline with hosting, SSL, monitoring, and backup systems configured for production use."
        }
      ]
    },
    "result": "A fully functional, production-ready application deployed in days instead of months. Includes all source code, documentation, hosting setup, and training. Reduces development costs by up to 70% while maintaining enterprise-grade quality and scalability.",
    "image": "/tvorflow-platform.png"
  }
}
